###########################################################################################
# while문 이용해 1 ~ 9 중 홀수만 더하기
i = 0
result = 0
while i <= 9:
    if i % 2 == 1:
        result += i
    i += 1
print(result)

###########################################################################################
# for문 이용해 1 ~ 9 중 홀수만 더하기
result = 0
for i in range(1, 10):
    if i % 2 == 1:
        result += i
print(result)

# continue 활용: 블랙리스트 학생 제외
scores = [90, 85, 77, 65, 97]
cheating_list = [2, 4]
for i in range(len(scores)):
    if i + 1 in cheating_list:
        continue
    if scores[i] >= 80:
        print(i + 1, "번 학생은 합격입니다.")

###########################################################################################